music_app/app/controllers/sessions_controller.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "wGS24jhYv5OaXcbxceTNeg"], ["updated_at", "2020-01-07 22:28:30.202097"], ["id", 3]]
---
  def create
    user = User.find_by_credentials(
      params[:email],
      params[:password]
      )
      debugger

      if user.save