music_app/app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id]) #use find usually with wildcard (hardcoded id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]